Masmiseim36/nxpSDK/boards/frdmkv11z/demo_apps/mc_pmsm/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2018 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC1 (number 44), J18[14]/J22[A40]/J500[9]/U2[3]/FTM0_CH0/LED0
  @{ */
/*!
 * @brief Device name: FTM0 */
#define PINTOOL_FTM_LED_GREEN1_PERIPHERAL FTM0
/*!
 * @brief FTM0 signal: CH */
#define PINTOOL_FTM_LED_GREEN1_SIGNAL CH
/*!
 * @brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_GREEN1_PORT PORTC
/*!
 * @brief PORTC pin index: 1 */
#define PINTOOL_FTM_LED_GREEN1_PIN 1U
/*!
 * @brief FTM0 channel: 0 */
#define PINTOOL_FTM_LED_GREEN1_CHANNEL 0
/*!
 * @brief Pin name */
#define PINTOOL_FTM_LED_GREEN1_PIN_NAME FTM0_CH0
/*!
 * @brief Label */
#define PINTOOL_FTM_LED_GREEN1_LABEL "J18[14]/J22[A40]/J500[9]/U2[3]/FTM0_CH0/LED0"
/*!
 * @brief Identifier name */
#define PINTOOL_FTM_LED_GREEN1_NAME "LED_GREEN1"
/*!
 * @brief Direction */
#define PINTOOL_FTM_LED_GREEN1_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PORTC2 (number 45), J18[15]/J22[A39]/J24[15]/J500[11]/U2[4]/FTM0_CH1/LED1
  @{ */
/*!
 * @brief Device name: FTM0 */
#define PINTOOL_FTM_LED_YELLOW1_PERIPHERAL FTM0
/*!
 * @brief FTM0 signal: CH */
#define PINTOOL_FTM_LED_YELLOW1_SIGNAL CH
/*!
 * @brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_YELLOW1_PORT PORTC
/*!
 * @brief PORTC pin index: 2 */
#define PINTOOL_FTM_LED_YELLOW1_PIN 2U
/*!
 * @brief FTM0 channel: 1 */
#define PINTOOL_FTM_LED_YELLOW1_CHANNEL 1
/*!
 * @brief Pin name */
#define PINTOOL_FTM_LED_YELLOW1_PIN_NAME FTM0_CH1
/*!
 * @brief Label */
#define PINTOOL_FTM_LED_YELLOW1_LABEL "J18[15]/J22[A39]/J24[15]/J500[11]/U2[4]/FTM0_CH1/LED1"
/*!
 * @brief Identifier name */
#define PINTOOL_FTM_LED_YELLOW1_NAME "LED_YELLOW1"
/*!
 * @brief Direction */
#define PINTOOL_FTM_LED_YELLOW1_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PORTC3 (number 46), J1[1]/J18[16]/J22[A38]/J24[16]/J500[30]/U2[5]/FTM0_CH2/LED2
  @{ */
/*!
 * @brief Device name: FTM0 */
#define PINTOOL_FTM_LED_GREEN2_PERIPHERAL FTM0
/*!
 * @brief FTM0 signal: CH */
#define PINTOOL_FTM_LED_GREEN2_SIGNAL CH
/*!
 * @brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_GREEN2_PORT PORTC
/*!
 * @brief PORTC pin index: 3 */
#define PINTOOL_FTM_LED_GREEN2_PIN 3U
/*!
 * @brief FTM0 channel: 2 */
#define PINTOOL_FTM_LED_GREEN2_CHANNEL 2
/*!
 * @brief Pin name */
#define PINTOOL_FTM_LED_GREEN2_PIN_NAME FTM0_CH2
/*!
 * @brief Label */
#define PINTOOL_FTM_LED_GREEN2_LABEL "J1[1]/J18[16]/J22[A38]/J24[16]/J500[30]/U2[5]/FTM0_CH2/LED2"
/*!
 * @brief Identifier name */
#define PINTOOL_FTM_LED_GREEN2_NAME "LED_GREEN2"
/*!
 * @brief Direction */
#define PINTOOL_FTM_LED_GREEN2_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PORTC4 (number 49), J22[A37]/J24[17]/J500[32]/U2[6]/FTM0_CH3/LED3
  @{ */
/*!
 * @brief Device name: FTM0 */
#define PINTOOL_FTM_LED_YELLOW2_PERIPHERAL FTM0
/*!
 * @brief FTM0 signal: CH */
#define PINTOOL_FTM_LED_YELLOW2_SIGNAL CH
/*!
 * @brief PORT device name: PORTC */
#define PINTOOL_FTM_LED_YELLOW2_PORT PORTC
/*!
 * @brief PORTC pin index: 4 */
#define PINTOOL_FTM_LED_YELLOW2_PIN 4U
/*!
 * @brief FTM0 channel: 3 */
#define PINTOOL_FTM_LED_YELLOW2_CHANNEL 3
/*!
 * @brief Pin name */
#define PINTOOL_FTM_LED_YELLOW2_PIN_NAME FTM0_CH3
/*!
 * @brief Label */
#define PINTOOL_FTM_LED_YELLOW2_LABEL "J22[A37]/J24[17]/J500[32]/U2[6]/FTM0_CH3/LED3"
/*!
 * @brief Identifier name */
#define PINTOOL_FTM_LED_YELLOW2_NAME "LED_YELLOW2"
/*!
 * @brief Direction */
#define PINTOOL_FTM_LED_YELLOW2_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PORTD4 (number 61), J22[B40]/J24[25]/J500[34]/U2[7]/FTM0_CH4/LED4
  @{ */
/*!
 * @brief Device name: FTM0 */
#define PINTOOL_FTM_LED_GREEN3_PERIPHERAL FTM0
/*!
 * @brief FTM0 signal: CH */
#define PINTOOL_FTM_LED_GREEN3_SIGNAL CH
/*!
 * @brief PORT device name: PORTD */
#define PINTOOL_FTM_LED_GREEN3_PORT PORTD
/*!
 * @brief PORTD pin index: 4 */
#define PINTOOL_FTM_LED_GREEN3_PIN 4U
/*!
 * @brief FTM0 channel: 4 */
#define PINTOOL_FTM_LED_GREEN3_CHANNEL 4
/*!
 * @brief Pin name */
#define PINTOOL_FTM_LED_GREEN3_PIN_NAME FTM0_CH4
/*!
 * @brief Label */
#define PINTOOL_FTM_LED_GREEN3_LABEL "J22[B40]/J24[25]/J500[34]/U2[7]/FTM0_CH4/LED4"
/*!
 * @brief Identifier name */
#define PINTOOL_FTM_LED_GREEN3_NAME "LED_GREEN3"
/*!
 * @brief Direction */
#define PINTOOL_FTM_LED_GREEN3_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*! @name PORTD5 (number 62), J22[B39]/J24[26]/J500[36]/U2[8]/FTM0_CH5/LED5
  @{ */
/*!
 * @brief Device name: FTM0 */
#define PINTOOL_FTM_LED_YELLOW3_PERIPHERAL FTM0
/*!
 * @brief FTM0 signal: CH */
#define PINTOOL_FTM_LED_YELLOW3_SIGNAL CH
/*!
 * @brief PORT device name: PORTD */
#define PINTOOL_FTM_LED_YELLOW3_PORT PORTD
/*!
 * @brief PORTD pin index: 5 */
#define PINTOOL_FTM_LED_YELLOW3_PIN 5U
/*!
 * @brief FTM0 channel: 5 */
#define PINTOOL_FTM_LED_YELLOW3_CHANNEL 5
/*!
 * @brief Pin name */
#define PINTOOL_FTM_LED_YELLOW3_PIN_NAME FTM0_CH5
/*!
 * @brief Label */
#define PINTOOL_FTM_LED_YELLOW3_LABEL "J22[B39]/J24[26]/J500[36]/U2[8]/FTM0_CH5/LED5"
/*!
 * @brief Identifier name */
#define PINTOOL_FTM_LED_YELLOW3_NAME "LED_YELLOW3"
/*!
 * @brief Direction */
#define PINTOOL_FTM_LED_YELLOW3_DIRECTION kPIN_MUX_DirectionInput
/* @} */

/*!
 * @brief 
 *
 */
void PinTool_FTM(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 Receive Data Source Select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 Transmit Data Source Select: UART0_TX pin */

/*! @name PORTB16 (number 39), J24[9]/J500[7]/J506[2]/U512[2]/RXD0
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PERIPHERAL UART0                            /*!<@brief Device name: UART0 */
#define PINTOOL_UART_DEBUG_UART_RX_SIGNAL RX                                   /*!<@brief UART0 signal: RX */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTB                                  /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 16U                                     /*!<@brief PORTB pin index: 16 */
#define PINTOOL_UART_DEBUG_UART_RX_PIN_NAME UART0_RX                           /*!<@brief Pin name */
#define PINTOOL_UART_DEBUG_UART_RX_LABEL "J24[9]/J500[7]/J506[2]/U512[2]/RXD0" /*!<@brief Label */
#define PINTOOL_UART_DEBUG_UART_RX_NAME "DEBUG_UART_RX"                        /*!<@brief Identifier name */
                                                                               /* @} */

/*! @name PORTB17 (number 40), J24[10]/J500[5]/J505[2]/U513[4]/TXD0
  @{ */
#define PINTOOL_UART_DEBUG_UART_TX_PERIPHERAL UART0                             /*!<@brief Device name: UART0 */
#define PINTOOL_UART_DEBUG_UART_TX_SIGNAL TX                                    /*!<@brief UART0 signal: TX */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTB                                   /*!<@brief PORT device name: PORTB */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 17U                                      /*!<@brief PORTB pin index: 17 */
#define PINTOOL_UART_DEBUG_UART_TX_PIN_NAME UART0_TX                            /*!<@brief Pin name */
#define PINTOOL_UART_DEBUG_UART_TX_LABEL "J24[10]/J500[5]/J505[2]/U513[4]/TXD0" /*!<@brief Label */
#define PINTOOL_UART_DEBUG_UART_TX_NAME "DEBUG_UART_TX"                         /*!<@brief Identifier name */
                                                                                /* @} */

/*!
 * @brief 
 *
 */
void PinTool_UART(void);

/*! @name PORTD6 (number 63), J22[B33]/J22[D34]/J24[27]/J500[13]/U2[9]/FTM1_CH0/LED6
  @{ */
/*!
 * @brief Device name: GPIOD */
#define PINTOOL_MISC_LED_ORANGE_PERIPHERAL GPIOD
/*!
 * @brief GPIOD signal: GPIO */
#define PINTOOL_MISC_LED_ORANGE_SIGNAL GPIO
/*!
 * @brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_ORANGE_GPIO GPIOD
/*!
 * @brief PORTD pin index: 6 */
#define PINTOOL_MISC_LED_ORANGE_GPIO_PIN 6U
/*!
 * @brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_ORANGE_PORT PORTD
/*!
 * @brief PORTD pin index: 6 */
#define PINTOOL_MISC_LED_ORANGE_PIN 6U
/*!
 * @brief GPIOD GPIO channel: 6 */
#define PINTOOL_MISC_LED_ORANGE_CHANNEL 6
/*!
 * @brief Pin name */
#define PINTOOL_MISC_LED_ORANGE_PIN_NAME PTD6
/*!
 * @brief Label */
#define PINTOOL_MISC_LED_ORANGE_LABEL "J22[B33]/J22[D34]/J24[27]/J500[13]/U2[9]/FTM1_CH0/LED6"
/*!
 * @brief Identifier name */
#define PINTOOL_MISC_LED_ORANGE_NAME "LED_ORANGE"
/* @} */

/*! @name PORTA4 (number 26), J24[7]/J500[14]/SW2
  @{ */
#define PINTOOL_MISC_SW2_PERIPHERAL GPIOA            /*!<@brief Device name: GPIOA */
#define PINTOOL_MISC_SW2_SIGNAL GPIO                 /*!<@brief GPIOA signal: GPIO */
#define PINTOOL_MISC_SW2_GPIO GPIOA                  /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_SW2_GPIO_PIN 4U                 /*!<@brief PORTA pin index: 4 */
#define PINTOOL_MISC_SW2_PORT PORTA                  /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_SW2_PIN 4U                      /*!<@brief PORTA pin index: 4 */
#define PINTOOL_MISC_SW2_CHANNEL 4                   /*!<@brief GPIOA GPIO channel: 4 */
#define PINTOOL_MISC_SW2_PIN_NAME PTA4               /*!<@brief Pin name */
#define PINTOOL_MISC_SW2_LABEL "J24[7]/J500[14]/SW2" /*!<@brief Label */
#define PINTOOL_MISC_SW2_NAME "SW2"                  /*!<@brief Identifier name */
                                                     /* @} */

/*!
 * @brief 
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
